
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Или Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.Сотрудник.Доступность = Ложь;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
				
		Объект.ДнейОтпуска = (Объект.ДатаОкончания - Объект.ДатаНачала + 86400) / 86400;
		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент) 
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.Сотрудник.Доступность = Истина; 
		
		Объект.ДнейОтпуска = (Объект.ДатаОкончания - Объект.ДатаНачала + 86400) / 86400;
		
		Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
			
			РассчитатьОтпускные();	
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент) 
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.Сотрудник.Доступность = Истина; 
		
		Объект.ДнейОтпуска = (Объект.ДатаОкончания - Объект.ДатаНачала + 86400) / 86400;
		
		Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
			
			РассчитатьОтпускные();	
			
		КонецЕсли;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент) 
	
	РассчитатьОтпускные();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьОтпускные()   
	
	КонецРасчетногоПериода = Объект.ДатаНачала - 86400;
	НачалоРасчетногоПериода  = ДобавитьМесяц(КонецРасчетногоПериода, -12);  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия, 0)) КАК ОтработаноДней,
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	               |	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.Результат, 0)) КАК Результат
	               |ПОМЕСТИТЬ вт_ОсновныеНачисления
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	               |ГДЕ
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = &Сотрудник
	               |	И ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодРегистрации МЕЖДУ &Начало И &Конец
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(вт_ОсновныеНачисления.ОтработаноДней, 0)) КАК ОтработаноДней,
	               |	СУММА(ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)) КАК СуммаДополнительная,
	               |	СУММА(ЕСТЬNULL(вт_ОсновныеНачисления.Результат, 0)) КАК СуммаОсновная
	               |ИЗ
	               |	вт_ОсновныеНачисления КАК вт_ОсновныеНачисления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |		ПО вт_ОсновныеНачисления.Сотрудник = ВКМ_ДополнительныеНачисления.Сотрудник
	               |			И (ВКМ_ДополнительныеНачисления.ПериодРегистрации МЕЖДУ &Начало И &Конец)";
	
	Запрос.УстановитьПараметр("Начало", НачалоРасчетногоПериода);
	Запрос.УстановитьПараметр("Конец", КонецРасчетногоПериода);  
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	
	РезультатЗапроса =  Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		Если Выборка.ОтработаноДней = 0 Тогда
		
			Объект.ОтработаноДней = 0;	
			Объект.ДоходЗа12Месяцев = 0;
			Объект.Размер = 0;
			
		Иначе 
		
			Объект.ОтработаноДней = Выборка.ОтработаноДней;	
			Объект.ДоходЗа12Месяцев = Выборка.СуммаОсновная + Выборка.СуммаДополнительная;
			Объект.Размер = (Объект.ДоходЗа12Месяцев / Объект.ОтработаноДней) * Объект.ДнейОтпуска;
	
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры

#КонецОбласти
