
#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьФорму(Форма) Экспорт   
	
	ИмяФормы = Форма.ИмяФормы; 
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда   
		
		ДобавитьГруппуРеквизитовАбонентскогоДоговора(Форма);
		ДобавитьПолеДатаНачалаДействия(Форма);
		ДобавитьПолеДатаОкончанияДействия(Форма); 
		ДобавитьПолеСуммаАбонентскойПлаты(Форма);
		ДобавитьПолеСтоимостьЧасаРаботы(Форма);
	
	КонецЕсли;
	
КонецПроцедуры  

Процедура ВернутьФормуВИсходноеСостояние(Форма) Экспорт  
	
	Форма.Элементы.Удалить(Форма.Элементы.ГруппаРеквизитовАбонентскогоДоговора);  
КонецПроцедуры

	
Процедура ДобавитьПолеДатаНачалаДействия(Форма)  
	
	ПолеВвода = Форма.Элементы.Добавить("ДатаНачалаДействия", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеквизитовАбонентскогоДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";
	
КонецПроцедуры       

Процедура ДобавитьПолеДатаОкончанияДействия(Форма)  
	
	ПолеВвода = Форма.Элементы.Добавить("ДатаОкончанияДействия", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеквизитовАбонентскогоДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
	
КонецПроцедуры  

Процедура ДобавитьПолеСуммаАбонентскойПлаты(Форма)  
	
	ПолеВвода = Форма.Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеквизитовАбонентскогоДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
КонецПроцедуры  

Процедура ДобавитьПолеСтоимостьЧасаРаботы(Форма)  
	
	ПолеВвода = Форма.Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), Форма.Элементы.ГруппаРеквизитовАбонентскогоДоговора);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры  





Процедура ДобавитьГруппуРеквизитовАбонентскогоДоговора(Форма)
	
	ГруппаРеквизитовАбонентскогоДоговора = Форма.Элементы.Добавить("ГруппаРеквизитовАбонентскогоДоговора", Тип("ГруппаФормы")); 
	ГруппаРеквизитовАбонентскогоДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаРеквизитовАбонентскогоДоговора.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаРеквизитовАбонентскогоДоговора.ОтображатьЗаголовок = Ложь; 
	ГруппаРеквизитовАбонентскогоДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;	
	
КонецПроцедуры

#КонецОбласти

