
#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументыТяжелаяОперация(Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК ДоговорСсылка,
	               |	ДоговорыКонтрагентов.Наименование КАК ДоговорНаименование,
	               |	ДоговорыКонтрагентов.Организация КАК Организация,
	               |	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	               |	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия КАК ВКМ_ДатаНачалаДействия,
	               |	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия КАК ВКМ_ДатаОкончанияДействия,
	               |	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК ВКМ_СуммаАбонентскойПлаты,
	               |	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
	               |	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
	               |	ДоговорыКонтрагентов.Владелец КАК Владелец
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
	               |			И (РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);			   
	Запрос.УстановитьПараметр("НачалоПериода",  Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СозданныеДокументы = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.РеализацияСсылка = NULL Тогда
			
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();

			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("Дата", Период.ДатаОкончания);
			ДанныеЗаполнения.Вставить("Договор", Выборка.ДоговорСсылка); 
			ДанныеЗаполнения.Вставить("Контрагент", Выборка.Владелец); 
			ДанныеЗаполнения.Вставить("Организация", Выборка.Организация); 
					
			НовыйДокумент.ВКМ_СтандартныйАлгоритмЗаполнения(ДанныеЗаполнения);
			НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение();
			НовыйДокумент.ПроверитьЗаполнение();		
			НовыйДокумент.Записать();          
			
			СозданныеДокументы.Вставить(Выборка.ДоговорСсылка, НовыйДокумент.Ссылка); 
						
		Иначе
			
			СозданныеДокументы.Вставить(Выборка.ДоговорСсылка, "Документ уже создан");
			
		КонецЕсли;
			
	КонецЦикла;
		
	Возврат СозданныеДокументы;
	
КонецФункции

#КонецОбласти
