#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
			
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
		
		ВКМ_РаботаСФормами.ДополнитьФорму(ЭтотОбъект); 
		Объект.ВКМ_ФормаДополнена = Истина; 

	Иначе	
	
		Объект.ВКМ_ФормаДополнена = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере() 
	
	Если Не Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		Объект.ВКМ_ДатаНачалаДействия    = Неопределено;
		Объект.ВКМ_ДатаОкончанияДействия = Неопределено;
		Объект.ВКМ_СуммаАбонентскойПлаты = Неопределено;
		Объект.ВКМ_СтоимостьЧасаРаботы   = Неопределено;
		Объект.ВКМ_ФормаДополнена        = Неопределено;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент) 
	
	ВидДоговораПриИзмененииНаСервере(); 
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание И Не Объект.ВКМ_ФормаДополнена Тогда

		ВКМ_РаботаСФормами.ДополнитьФорму(ЭтотОбъект);		
		Объект.ВКМ_ФормаДополнена = Истина;
		
	ИначеЕсли Объект.ВКМ_ФормаДополнена Тогда
		
		ВКМ_РаботаСФормами.ВернутьФормуВИсходноеСостояние(ЭтотОбъект);
		Объект.ВКМ_ФормаДополнена = Ложь;
		
	КонецЕсли;  
		
КонецПроцедуры

#КонецОбласти
