#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
			
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
		
		ВКМ_РаботаСФормами.ДополнитьФорму(ЭтотОбъект); 
		ВКМ_ФормаДополнена = Истина; 

	Иначе	
	
		ВКМ_ФормаДополнена = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент) 
	
	ВидДоговораПриИзмененииНаСервере(); 
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание И Не ВКМ_ФормаДополнена Тогда

		ВКМ_РаботаСФормами.ДополнитьФорму(ЭтотОбъект);		
		ВКМ_ФормаДополнена = Истина;
		
	ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание И ВКМ_ФормаДополнена Тогда
		
		Элементы.ДатаНачалаДействия.Видимость = Истина;
		Элементы.ДатаОкончанияДействия.Видимость = Истина;
		Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
	
	ИначеЕсли Не Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание И ВКМ_ФормаДополнена Тогда
	
		Элементы.ДатаНачалаДействия.Видимость = Ложь;
		Элементы.ДатаОкончанияДействия.Видимость = Ложь;
		Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
		
	КонецЕсли;  
		
КонецПроцедуры

#КонецОбласти
