
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Или Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.СписокСотрудников.Доступность = Ложь;	
		
	Конецесли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Объект.ДатаНачала = НачалоМесяца(Объект.ДатаНачала);
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.СписокСотрудников.Доступность = Истина;	
		
	Конецесли;

	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)  
	
	Объект.ДатаОкончания = КонецМесяца(Объект.ДатаОкончания); 
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.СписокСотрудников.Доступность = Истина;	
		
	Конецесли;

	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСотрудников

&НаКлиенте
Процедура СписокСотрудниковСотрудникПриИзменении(Элемент)
	
	ТекущаяСтрокаТЧ = Элементы.СписокСотрудников.ТекущиеДанные; 
	
	ТекущийСотрудник = ТекущаяСтрокаТЧ.Сотрудник;
	
	ДанныеТекущегоСотрудника = СписокСотрудниковСотрудникПриИзмененииНаСервере(ТекущийСотрудник); 
	
	ТекущаяСтрокаТЧ.Размер          = ДанныеТекущегоСотрудника.Оклад;
	ТекущаяСтрокаТЧ.ТипРасчета      = ДанныеТекущегоСотрудника.ТипРасчета;
	ТекущаяСтрокаТЧ.РазмерПочасовой = ДанныеТекущегоСотрудника.РазмерПочасовой;
	
КонецПроцедуры                                                                                     

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокСотрудниковСотрудникПриИзмененииНаСервере(ТекущийСотрудник)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник.ВидРасчета КАК ВидРасчета,
	               |	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплатеПочасовая
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, Период, Сотрудник = &Сотрудник) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	               |		ПО ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
	               |ГДЕ
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
				   

	Запрос.УстановитьПараметр("Период", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("Сотрудник", ТекущийСотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеТекущегоСотрудника = Новый Структура; 
		
		ДанныеТекущегоСотрудника.Вставить("Оклад",           Выборка.Оклад);
		ДанныеТекущегоСотрудника.Вставить("ТипРасчета",      Выборка.ВидРасчета);
		ДанныеТекущегоСотрудника.Вставить("РазмерПочасовой", Выборка.СуммаКОплатеПочасовая); 
		
	КонецЦикла;
	
	Возврат ДанныеТекущегоСотрудника;
	
КонецФункции

#КонецОбласти



