
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();

	Для Каждого Строка Из СписокСотрудников Цикл	
	
		Движение             = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();		
		Движение.Период      = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сотрудник   = Строка.Сотрудник;  
		Движение.Сумма       = Строка.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти