
#Область  ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеГрафика = ПолучитьИзВременногоХранилища(Параметры.Адрес);  
	
	Диаграмма.Обновление = Ложь;

	Диаграмма.Очистить();

	Для Каждого Строка Из ДанныеГрафика Цикл;

    	Точка       = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		
		Серия       = Диаграмма.УстановитьСерию(Параметры.Год);
		Серия.Текст = Параметры.Год;
		
    	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		
    	Интервал = Значение.Добавить();
    	
    	Интервал.Начало = Строка.ДатаНачала;
   		Интервал.Конец  = Строка.ДатаОкончания;;

    КонецЦикла;

	Диаграмма.Обновление = Истина;

КонецПроцедуры 

#КонецОбласти
	

