#Область СлужебныеПроцедурыИФункции	 

Процедура ДобавитьУведомлениеВСправочникУведомлений(ТекстСообщения) Экспорт

	НовоеСообщение = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовоеСообщение.ТекстСообшения = ТекстСообщения;
	НовоеСообщение.Записать();
	
КонецПроцедуры   

Функция ОтправитьСообщениеВТелеграм(ТекстСообщения) Экспорт
	
	Сообщение = Новый Структура; 
	Сообщение.Вставить("chat_id", Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
	Сообщение.Вставить("text",ТекстСообщения);
	СообщениеJSON = ЗаписатьЗначениеJSON(Сообщение);

	Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Запрос = Новый HTTPЗапрос("/bot8458581973:AAHNd_XJgUZaWdqcOPdxv6rCi_ibYFUVHS4/sendMessage");
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.УстановитьТелоИзСтроки(СообщениеJSON);
	
	Результат = Соединение.Получить(Запрос); 
	
	Возврат Результат.КодСостояния; 
	
КонецФункции

Процедура ВКМ_ОтправкаСообщенийВТелеграм() Экспорт

    Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_УведомленияТелеграмБоту.ТекстСообшения КАК ТекстСообшения,
	               |	ВКМ_УведомленияТелеграмБоту.Ссылка КАК СсылкаСообщение
	               |ИЗ
	               |	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
	               |ГДЕ
	               |	ВКМ_УведомленияТелеграмБоту.ПометкаУдаления = Ложь";   
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ОтправитьСообщениеВТелеграм(Выборка.ТекстСообшения) = 200 Тогда
			
			ВыборкаОбъект = Выборка.СсылкаСообщение.ПолучитьОбъект();
			ВыборкаОбъект.Удалить(); 	
			
		КонецЕсли;	
			
    КонецЦикла;

КонецПроцедуры

#КонецОбласти
