
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Договор);
	
	Результат = Запрос.Выполнить();                     	
	Выборка = Результат.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		СтоимостьЧаса = Выборка.ВКМ_СтоимостьЧасаРаботы;		
		
	КонецЦикла;
	
	Объект.СуммаКОплате = Объект.ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту") * СтоимостьЧаса;	
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		
		Элементы.ВыполненныеРаботы.Доступность = Ложь;

	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	ДатаПроведенияРаботПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	
	СпециалистПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаРаботПланПриИзменении(Элемент)
	ВремяНачалаРаботПланПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
	
		Элементы.ВыполненныеРаботы.Доступность = Истина;  
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ДатаПроведенияРаботПриИзмененииНаСервере()

   	Если Не Объект.ДокументЗаписанВПервыйРаз Тогда
		
		ТекстСообщения = СтрШаблон("У Вашего обращения %1 изменилась дата проведения работ, новая дата - %2", Объект.Номер, Объект.ДатаПроведенияРабот);
		
		ВКМ_ТелеграмИнтеграция.ДобавитьУведомлениеВСправочникУведомлений(ТекстСообщения); 
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере                                             
Процедура ВремяНачалаРаботПланПриИзмененииНаСервере() 
	
   	Если Не Объект.ДокументЗаписанВПервыйРаз Тогда
		
		ТекстСообщения = СтрШаблон("У Вашего обращения %1 изменилось планируемое время проведения работ, новое время - %2", Объект.Номер, Объект.ВремяНачалаРаботПлан);
		
		ВКМ_ТелеграмИнтеграция.ДобавитьУведомлениеВСправочникУведомлений(ТекстСообщения); 
		
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура СпециалистПриИзмененииНаСервере() 
	
  	Если Не Объект.ДокументЗаписанВПервыйРаз Тогда
		
		ТекстСообщения = СтрШаблон("У Вашего обращения %1 изменился ответственный специалист, новый специалист - %2", Объект.Номер, Объект.Специалист);
		
		ВКМ_ТелеграмИнтеграция.ДобавитьУведомлениеВСправочникУведомлений(ТекстСообщения); 
		
	КонецЕсли;
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти


