
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		ПроверитьОтпуска(Строка.Сотрудник);
	
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		ПроверитьОтпуска(Строка.Сотрудник);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные; 
		
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаНачала) И ЗначениеЗаполнено(ТекущаяСтрока.ДатаОкончания) Тогда
		
		ТекущаяСтрока.Дней = ( 1 + (ТекущаяСтрока.ДатаОкончания - ТекущаяСтрока.ДатаНачала) / 86400); 
		
	КонецЕсли;
	
	ПроверитьОтпуска(ТекущаяСтрока.Сотрудник);		

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные; 
		
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаНачала) И ЗначениеЗаполнено(ТекущаяСтрока.ДатаОкончания) Тогда
		
		ТекущаяСтрока.Дней = ( 1 + (ТекущаяСтрока.ДатаОкончания - ТекущаяСтрока.ДатаНачала) / 86400); 
		
	КонецЕсли;  
	
    ПроверитьОтпуска(ТекущаяСтрока.Сотрудник);
		
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ДанныеДляГрафика = Новый Массив;
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		ДанныеСтроки = Новый Структура;
		
		ДанныеСтроки.Вставить("Сотрудник", Строка.Сотрудник);
		ДанныеСтроки.Вставить("ДатаНачала", Строка.ДатаНачала);
        ДанныеСтроки.Вставить("ДатаОкончания", Строка.ДатаОкончания);
	
		ДанныеДляГрафика.Добавить(ДанныеСтроки);
		
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(ДанныеДляГрафика);
	
	ПараметрыДляФормы = Новый Структура;
	
	ПараметрыДляФормы.Вставить("Адрес", Адрес);
	ПараметрыДляФормы.Вставить("Год", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыДляФормы);
		
КонецПроцедуры 

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьОтпуска(Сотрудник)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) + 1) КАК Дней
	               |ИЗ
	               |	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	               |ГДЕ
	               |	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
	               |	И ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник = &Сотрудник";
				   
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если Не Выборка.Дней = Null Тогда
		
			Если Выборка.Дней > 28 Тогда
			
				Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
				
					Если Строка.Сотрудник = Сотрудник Тогда
					
						Строка.Подсветить = Истина;
					
					КонецЕсли;
				
				КонецЦикла;
			
			Иначе     
				
				Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
				
					Если Строка.Сотрудник = Сотрудник Тогда
					
						Строка.Подсветить = Ложь;
					
					КонецЕсли;
				
				КонецЦикла;		
			
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
					
КонецПроцедуры

#КонецОбласти


