
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьКалендарь(Команда)
	
	ЗаполнитьКалендарьНаСервере();
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Обработка завершена!";
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКалендарьНаСервере() 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьКалендарь(ВыборПериода.ДатаНачала, ВыборПериода.ДатаОкончания, ВыходныеДни);

КонецПроцедуры

#КонецОбласти



