
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения(); 
	РассчитатьОсновныеДвижения();
	
КонецПроцедуры  

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
	Движения.ВКМ_ОсновныеНачисления.Очистить();
	
	Для Каждого Строка Из СписокСотрудников Цикл
				
		Движение                      = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации    = Дата; 
		Движение.ВидРасчета           = Строка.ТипРасчета;
		Движение.ПериодДействияНачало = ДатаНачала; 
		Движение.ПериодДействияКонец  = ДатаОкончания;
		Движение.Сотрудник            = Строка.Сотрудник;
		Движение.Размер               = Строка.Размер; 		
		Движение.РазмерПочасовой      = Строка.РазмерПочасовой;
				
	КонецЦикла;  
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры 

Процедура РассчитатьОсновныеДвижения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия КАК Факт,
	               |	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньПериодДействия КАК План
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
				             
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		//Регистр ВКМ_ОсновныеНачисления
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		
		ПланОкладЗаВычетомНДФЛ = Движение.Размер * 0.87;
		ПланОкладСуммаНДФЛ     = Движение.Размер - ПланОкладЗаВычетомНДФЛ;	
		
		Если Выборка.План = Выборка.Факт Тогда
			
			ФактОкладЗаВычетомНДФЛ = ПланОкладЗаВычетомНДФЛ;
			ФактОкладСуммаНДФЛ     = ПланОкладСуммаНДФЛ;
			 
		Иначе
			
			ФактОкладЗаВычетомНДФЛ = ПланОкладЗаВычетомНДФЛ * (Выборка.Факт / Выборка.План);	
			ФактОкладСуммаНДФЛ     = ПланОкладСуммаНДФЛ * (Выборка.Факт / Выборка.План);
			
		КонецЕсли;
			
		ПочасоваяЗаВычетомНДФЛ = Движение.РазмерПочасовой * 0.87;
        ПочасоваяСуммаНДФЛ     = Движение.РазмерПочасовой - ПочасоваяЗаВычетомНДФЛ;
           
		ИтоговаяЗаВычетомНДФЛ = ФактОкладЗаВычетомНДФЛ + ПочасоваяЗаВычетомНДФЛ;
		ИтоговаяНДФЛ          = ФактОкладСуммаНДФЛ + ПочасоваяСуммаНДФЛ;

		Движение.Результат = ИтоговаяЗаВычетомНДФЛ; 
				
		//Регистр ВКМ_ВзаиморасчетыССотрудниками
		
		ДвижениеВзаиморасчетыССотрудниками = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		
		ДвижениеВзаиморасчетыССотрудниками.Период = Дата;
		ДвижениеВзаиморасчетыССотрудниками.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчетыССотрудниками.Сотрудник = Движение.Сотрудник;  
		ДвижениеВзаиморасчетыССотрудниками.Сумма = ИтоговаяЗаВычетомНДФЛ;
		
		//Регистр ВКМ_Удержания
		
		ДвижениеУдержания                      = Движения.ВКМ_Удержания.Добавить();
		ДвижениеУдержания.ПериодРегистрации    = Дата; 
		ДвижениеУдержания.ПериодДействияНачало = ДатаНачала; 
		ДвижениеУдержания.ВидРасчета           = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеУдержания.ПериодДействияКонец  = ДатаОкончания;
		ДвижениеУдержания.Сотрудник            = Движение.Сотрудник;
		ДвижениеУдержания.Результат            = ИтоговаяНДФЛ;

	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры    

#КонецОбласти
