
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения(); 
	
КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()    
	
	Для Каждого Строка Из СписокСотрудников Цикл
		
	//Регистр ВКМ_ДополнительныеНачисления
		
		Движение                      = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации    = Дата; 
		Движение.ВидРасчета           = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Движение.ПериодДействияНачало = ДатаНачала; 
		Движение.ПериодДействияКонец  = ДатаОкончания;
		Движение.Сотрудник            = Строка.Сотрудник;
		Движение.Размер               = Строка.Размер; 
		Движение.Результат            = 0.87 * Строка.Размер;
		
	//Регистр ВКМ_ВзаиморасчетыССотрудниками
	
		Движение             = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период      = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник   = Строка.Сотрудник;
		Движение.Сумма       = 0.87 * Строка.Размер;
		
	КонецЦикла;  
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

#КонецОбласти