
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСотрудников

&НаКлиенте
Процедура СписокСотрудниковСотрудникПриИзменении(Элемент) 
	
	ТекущаяСтрокаТЧ = Элементы.СписокСотрудников.ТекущиеДанные; 	
	ТекущийСотрудник = ТекущаяСтрокаТЧ.Сотрудник;
	
	ТекущаяСтрокаТЧ.Сумма = СписокСотрудниковСотрудникПриИзмененииНаСервере(ТекущийСотрудник);
		
КонецПроцедуры

#КонецОбласти

#Область  СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокСотрудниковСотрудникПриИзмененииНаСервере(ТекущийСотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток) КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	               |ГДЕ
	               |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", ТекущийСотрудник);
	Запрос.УстановитьПараметр("Период", Объект.Дата); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СуммаЗарплаты = Выборка.СуммаОстаток;			
		
	КонецЦикла;
	
	Возврат СуммаЗарплаты;
		
КонецФункции

#КонецОбласти
