
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСотрудников

&НаКлиенте
Процедура СписокСотрудниковСотрудникПриИзменении(Элемент) 
	
	ТекущаяСтрокаТЧ = Элементы.СписокСотрудников.ТекущиеДанные; 	
	ТекущийСотрудник = ТекущаяСтрокаТЧ.Сотрудник;
	
	ТекущаяСтрокаТЧ.Сумма = СписокСотрудниковСотрудникПриИзмененииНаСервере(ТекущийСотрудник);
		
КонецПроцедуры

#КонецОбласти
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры


#Область  СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокСотрудниковСотрудникПриИзмененииНаСервере(ТекущийСотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток) КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	               |ГДЕ
	               |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", ТекущийСотрудник);
	Запрос.УстановитьПараметр("Период", Объект.Дата); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СуммаЗарплаты = Выборка.СуммаОстаток;			
		
	КонецЦикла;
	
	Возврат СуммаЗарплаты;
		
КонецФункции


&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.СписокСотрудников.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ Выборка.СуммаОстаток = NULL И Выборка.СуммаОстаток > 0 Тогда
			
			НоваяСтрокаТЧ           = Объект.СписокСотрудников.Добавить();
			НоваяСтрокаТЧ.Сотрудник = Выборка.Сотрудник;
			НоваяСтрокаТЧ.Сумма     = Выборка.СуммаОстаток;
			
		КонецЕсли;
		
	КонецЦикла
	
КонецПроцедуры
#КонецОбласти
