
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	Движения.ВКМ_ОсновныеНачисления.Очистить();
	
	//Регистр ВКМ_ОсновныеНачисления
	
	Движение                      = Движения.ВКМ_ОсновныеНачисления.Добавить();
	Движение.ПериодРегистрации    = Дата; 
	Движение.ВидРасчета           = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск; 
	Движение.ПериодДействияНачало = ДатаНачала; 
	Движение.ПериодДействияКонец  = ДатаОкончания;
	Движение.Сотрудник            = Сотрудник;
	Движение.Размер               = Размер; 
	Движение.Результат            = 0.87 * Размер;
				
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	//Регистр ВКМ_ВзаиморасчетыССотрудниками
	
	Движение             = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
	Движение.Период      = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Сотрудник   = Сотрудник;
	Движение.Сумма       = 0.87 * Размер;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
	//Регистр ВКМ_Удержания
		
	ДвижениеУдержания                      = Движения.ВКМ_Удержания.Добавить();
	ДвижениеУдержания.ПериодРегистрации    = Дата; 
	ДвижениеУдержания.ПериодДействияНачало = ДатаНачала; 
	ДвижениеУдержания.ВидРасчета           = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
	ДвижениеУдержания.ПериодДействияКонец  = ДатаОкончания;
	ДвижениеУдержания.Сотрудник            = Сотрудник;
	ДвижениеУдержания.Результат            = 0.13 * Размер;
		
	Движения.ВКМ_Удержания.Записать();
		
КонецПроцедуры 

#КонецОбласти 

