
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_Сотрудники.СтавкаЧаса КАК СтавкаЧаса
	               |ИЗ
	               |	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
	               |ГДЕ
	               |	ВКМ_Сотрудники.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Специалист);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка         = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтавкаЧасаСотрудника = Выборка.СтавкаЧаса;
		
	КонецЦикла;
				   
	
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		Если (ДатаПроведенияРабот < Договор.ВКМ_ДатаНачалаДействия) ИЛИ (ДатаПроведенияРабот > Договор.ВКМ_ДатаОкончанияДействия) Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Дата проведения работ не попадает в срок действия договора";
			Сообщение.Сообщить();

			Отказ = Истина;
			
		ИначеЕсли Не ЗначениеЗаполнено(СтавкаЧасаСотрудника) Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "У специалиста не указана ставка часа";
			Сообщение.Сообщить();
			
			Отказ = Истина;

		КонецЕсли;
		
	КонецЕсли;    
	

		
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВКМ_ВыполненныеКлиентуРаботы Приход 
	
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина; 
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
	
	Движение                 = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения     = ВидДвиженияНакопления.Приход;
	Движение.Период          = Дата;
	Движение.Клиент          = Клиент;
	Движение.Договор         = Договор;  
	Движение.КоличествоЧасов = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	Движение.СуммаКОплате    = СуммаКОплате;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ    
		
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	
	Движение              = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
	Движение.Период       = Дата;
	Движение.Сотрудник    = Специалист;  
	Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов");
	Движение.СуммаКОплате = СуммаКОплате * СтавкаЧасаСотрудника / 100; 	
		
КонецПроцедуры     

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
	
		Возврат;
		
	КонецЕсли;
	
	Если ДокументЗаписанВПервыйРаз Тогда 
		
		ТекстСообщения = СтрШаблон("Номер Вашего обращения - %1. Наш специалист %2 посетит Вас %3 в %4", Номер, Специалист, Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"),ВремяНачалаРаботПлан);
		
		ВКМ_ТелеграмИнтеграция.ДобавитьУведомлениеВСправочникУведомлений(ТекстСообщения);				

		ДокументЗаписанВПервыйРаз = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Специалист = Пользователи.ТекущийПользователь(); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли






