
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_Сотрудники.СтавкаЧаса КАК СтавкаЧаса
	               |ИЗ
	               |	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
	               |ГДЕ
	               |	ВКМ_Сотрудники.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Специалист);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка         = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтавкаЧасаСотрудника = Выборка.СтавкаЧаса;
		
	КонецЦикла;
				   
	
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		Если (ДатаПроведенияРабот < Договор.ВКМ_ДатаНачалаДействия) ИЛИ (ДатаПроведенияРабот > Договор.ВКМ_ДатаОкончанияДействия) Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Дата проведения работ не попадает в срок действия договора";
			Сообщение.Сообщить();

			Отказ = Истина;
			
		ИначеЕсли Не ЗначениеЗаполнено(СтавкаЧасаСотрудника) Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "У специалиста не указана ставка часа";
			Сообщение.Сообщить();
			
			Отказ = Истина;

		КонецЕсли;
		
	КонецЕсли;    
	

		
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВКМ_ВыполненныеКлиентуРаботы Приход 
	
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина; 
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
	
	Движение                   = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения       = ВидДвиженияНакопления.Приход;
	Движение.Период            = Дата;
	Движение.Клиент            = Клиент;
	Движение.Договор           = Договор;  
	Движение.КоличествоЧасов   = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	Движение.СуммаКОплате      = СуммаКОплате;
	Движение.ДокументОснование = Ссылка;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ    
		
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	
	Движение              = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
	Движение.Период       = Дата;
	Движение.Сотрудник    = Специалист;  
	Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов");
	Движение.СуммаКОплате = СуммаКОплате * СтавкаЧасаСотрудника / 100; 	
		
КонецПроцедуры     

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
	
		Возврат;
		
	КонецЕсли;
	
	Если ДокументЗаписанВПервыйРаз Тогда 
		
		ТекстСообщения = СтрШаблон("Номер Вашего обращения - %1. Наш специалист %2 посетит Вас %3 в %4", Номер, Специалист, Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"),ВремяНачалаРаботПлан);
		
		ВКМ_ТелеграмИнтеграция.ДобавитьУведомлениеВСправочникУведомлений(ТекстСообщения);				

		ДокументЗаписанВПервыйРаз = Ложь;
		
	Иначе	
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан КАК ВремяОкончанияРаботПлан
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать(); 
		
		Если Выборка.Следующий() Тогда 
			
			ДатаПроведенияРаботПредыдущая     = Выборка.ДатаПроведенияРабот; 
			ВремяНачалаРаботПланПредыдущая    = Выборка.ВремяНачалаРаботПлан;
			ВремяОкончанияРаботПланПредыдущая = Выборка.ВремяОкончанияРаботПлан; 
			СпециалистПредыдущая              = Выборка.Специалист; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Не ДокументЗаписанВПервыйРаз И Не ДатаПроведенияРаботПредыдущая = ДатаПроведенияРабот Тогда
		
		ТекстСообщения = СтрШаблон("У Вашего обращения %1 изменилась планируемая дата проведения работ, новая дата - %2", Номер, ДатаПроведенияРабот);
		
		ВКМ_ТелеграмИнтеграция.ДобавитьУведомлениеВСправочникУведомлений(ТекстСообщения); 
				
	КонецЕсли;
	
	Если Не ДокументЗаписанВПервыйРаз И Не ВремяНачалаРаботПланПредыдущая = ВремяНачалаРаботПлан Тогда
		
		ТекстСообщения = СтрШаблон("У Вашего обращения %1 изменилось планируемое время  начала работ, новое время - %2", Номер, ВремяНачалаРаботПлан);
		
		ВКМ_ТелеграмИнтеграция.ДобавитьУведомлениеВСправочникУведомлений(ТекстСообщения); 
				
	КонецЕсли;
	
	Если Не ДокументЗаписанВПервыйРаз И Не ВремяОкончанияРаботПланПредыдущая = ВремяОкончанияРаботПлан Тогда
		
		ТекстСообщения = СтрШаблон("У Вашего обращения %1 изменилось планируемое время окончания работ, новое время - %2", Номер, ВремяОкончанияРаботПлан);
		
		ВКМ_ТелеграмИнтеграция.ДобавитьУведомлениеВСправочникУведомлений(ТекстСообщения); 
				
	КонецЕсли;
	
	Если Не ДокументЗаписанВПервыйРаз И Не СпециалистПредыдущая = Специалист Тогда
		
		ТекстСообщения = СтрШаблон("У Вашего обращения %1 изменился специалист, новый специалист - %2", Номер, Специалист);
		
		ВКМ_ТелеграмИнтеграция.ДобавитьУведомлениеВСправочникУведомлений(ТекстСообщения); 
				
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Специалист = Пользователи.ТекущийПользователь(); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли






