#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если День(Объект.Период.ДатаНачала) <> 1 Или День(Объект.Период.ДатаОкончания) < 28 Тогда
		
		Сообщение = Новый СообщениеПользователю(); 
		Сообщение.Текст = "Необходимо выбрать в качестве периода один месяц";
		Сообщение.Сообщить();
		
		Возврат;
			
	КонецЕсли;
	
	ДлительнаяОперация = СоздатьДокументыНаСервере(УникальныйИдентификатор);	
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1; 
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении",ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьДокументыНаСервере(УникальныйИдентификатор)
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыТяжелаяОперация", Объект.Период);
	
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда 
		
		ДанныеДляВнесения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Для Каждого Элемент Из ДанныеДляВнесения Цикл
			
		НоваяСтрокаТЧ                        = Объект.СозданныеДокументы.Добавить();
		НоваяСтрокаТЧ.Договор                = Элемент.Ключ;
		НоваяСтрокаТЧ.РеализацияТоваровУслуг = Элемент.Значение;
				
		КонецЦикла
		
	Иначе 
		
		Сообщение = Новый СообщениеПользователю(); 
		Сообщение.Текст = Результат.Статус;
		Сообщение.Сообщить();
		
	КонецЕсли;
		
КонецПроцедуры    
     
#КонецОбласти

